import asyncio
import random
import pyfiglet
import re
import requests
import os
import shutil
import time
from datetime import datetime
from PIL import Image, ImageDraw, ImageFont
from pySmartDL import SmartDL
from telethon.tl import functions
from telethon.errors import ChatSendInlineForbiddenError, ChatSendStickersForbiddenError
from cowpy import cow
from telethon.tl.functions.users import GetFullUserRequest
from telethon.tl.types import ChannelParticipantsAdmins, MessageEntityMentionName
from time import sleep
from datetime import datetime
from telethon import Button, events
from telethon.events import CallbackQuery
from telethon.utils import get_display_name
from collections import deque
from random import choice
from userbot import iqthon
from ..helpers import catmemes
from ..core.managers import edit_or_reply, edit_delete
from . import ALIVE_NAME
from ..helpers import fonts as emojify
from ..helpers.utils import reply_id, _catutils, parse_pre, yaml_format, install_pip, get_user_from_event, _format
from . import deEmojify
from ..helpers import get_user_from_event
plugin_category = "fun"
from userbot.utils import admin_cmd, sudo_cmd, eor
from ..sql_helper.bot_pms_sql import add_user_to_db,    get_user_id,    get_user_logging,    get_user_reply

@iqthon.iq_cmd(pattern="حفض كتابه$")
async def saf(e):
    x = await e.get_reply_message()
    if not x:
        return await eod(            e, "قم بالرد على أي رسالة لحفظها في رسائلك المحفوظة", time=5        )
    if e.out:
        await e.client.send_message("me", x)
    else:
        await e.client.send_message(e.sender_id, x)
    await eor(e, "تم حفظ الرسالة", time=5)

osfle = [  "〔 لا خلقۿ ولا اخلاق لحاله عايش ☹️. 〕","〔 سڪر محلي محطوط على ڪريما 🤤🍰. 〕","〔 ؏ـسل × ؏ـسل 🍯. 〕","〔 أنسان مرتب وڪشاخ بس مشكلتۿ يجذب هواي 😂. 〕","〔 ملڪ جمال ألعالم 🥺💘. 〕","〔 أنسان زباله ومكضيها نوم 🙂. 〕","〔 يعني بشرفك هوه هذا يستاهل اوصفه؟ 〕","〔 أنسان ڪيمر 😞💘. 〕","〔 جنۿ جڪليته يربيـﮧ 🍬. 〕","〔 شمأ اوصف بي قليل 🥵💞. 〕","〔 وجۿا جنة كاهي من ألصبحـﮧ ☹️♥️. 〕","〔 هذا واحد يهودي دير بالك منه 🙂💘. 〕","〔 هذا انسان يحب مقتدئ ابتعد عنه 😂💞. 〕","〔 بس تزحف ع الولد وهيه زرڪة 😂. 〕","〔 جنۿ مرڪة شجر شبيك يول 😂😔. 〕","〔 هذا حبيبي ، أحبة ڪولش 🙊💘 〕","〔 جمالهـﮧ خبلني 😞💞. 〕","〔 چنۿ ڪريمة ؏ـلى ڪيك 😞💘. 〕","〔 انسان مينطاق 🙂💔. 〕","〔 فد أنسان مرتب وريحتة تخبل 🥺💞 〕","〔 شڪد حلو هذا ومؤدب 😭💞💘💕. 〕","〔 وفف مو بشر ضيم لضيعه من ايدڪك نصيحة 🥺💞. 〕","〔 نتا مخلوق من ڪتله مال عارية 🙂😂. 〕","〔 لضيعۿ من أيدك خوش أنسانن وحباب رتبط بي احسلڪك 🥺. 〕","〔 با؏ هذا الصاڪك يربي شنو مخلوق منعسل 🥺🧿. 〕","〔 شني عمي مو بشر ڪيك ورب 🥺💞. 〕","〔 عوفه ضلعي هذا انسان زباله 🙂😂. 〕","〔 انسان ساقط لتحجي وياه انطي بلوڪك بدون تفاهم 🙂🤦‍♀️. 〕","〔 باع منو شون بشر هوه وجۿا يطرد النعمة 🙂. 〕","〔 عيع فد أنسان وصخ 😂♥️. 〕","〔 يول هذا طاڪك قطة احسلك 😂💞. 〕","〔 لازم واحد يضمه بقوطيه ويقفل عليه لان هالبشر ڪيك 🤤💘. 〕","〔 هذا الله غاضب عليه 🌚💔. 〕","〔 شنو شنو ؟ تسرسح يله 😒💘. 〕","〔 وردة مال الله ، فدوا اروحله 🤤💞. 〕"," أنسان مؤدب من البيت للجامع ، ومن الجامع للبيت 😞💞. 〕","〔 انسان بومة وبس نايم مدري شلون اهله ساكتيله 🌚💞. 〕","〔 أنت شايف وجها من يكعد الصبح ؟ عمي خلينا ساكتين 🙂😂. 〕","〔 الله وكيلك هذا اهله كلشي ممستافدين من عنده 🥲💞. 〕","〔 لكشنو من جمالل هذا يربييييي 😭💞. 〕","〔 يومة فديته جنه زربه 😭😂💞. 〕",]
shazla = [ "مهندس 😣💕.","عامل نظافه 😶.","عسكري 🤤.","دكتور 😞💞.","مختبري 💘.","هڪر 🌚.","قاضي 😂.","طيار ☹️.","معلم 🥺.","حلاق 😂😔. ","رائد فضاء 🐸😂. ","خباز 🥺💘. ","سايق مخده 😂. ","محاسب ☹️💘. ","ڪهربائي 🐸😂. ","فيتر 😂. ","رقاصه 🤤😂.","ويتر 🥲💞.","مضيف طائرات 😉😂.","سكرتير 😭💘.","اكل ونوم بس 🥲.","بيطري 🥲😂.","معاون طبيب 😭💞.","زبـال ♻️👽.","طـباخ 🧑‍🍳👩‍🍳.","فيتجـري 👨‍🦼.","نيـاج 🔞 .","منيـوج 🔞."," جـني 🧞‍♂️.","شـرطي 👮‍♂️👮‍♀️ ."," مقـاتل 🤺 ."," سـاحر 🧙‍♂️ ."," متـسلق 🧗‍♂️🧗‍♀️ ."," ريـاضي 🏃‍♂️🏃‍♀️ ."," مغنـي 🗣️ .","حـورية 🧜‍♂️🧜‍♀️ ."," زومـبي 🧟‍♂️🧟‍♀️ .","مبـرمج .",]
zogona2 = [ " زواجك مِـن بيرين سات 💘."," زواجك مِـن اسراء الأصيل 🥺💘."," زواجك مِـن رحمة رياض 🥺💘."," زواجك مِـن توبا بويوكوستن 🥺💘."," زواجك مِـن هازال كايا 🥺💘."," زواجك مِـن هندا ارتشيل 🥺💘."," زواجك مِـن ديميت اوزديمير 🥺💘."," زواجك مِـن اسراء شينغونالب 🥺💘."," زواجك مِـن اوزغو نامال 🥺💘."," زواجك مِـن عائشه شيدام 🥺💘."," زواجك مِـن انجلينا جولي 🥺💘."," زواجك مِـن كارينا كابور 🥺💘."," زواجج مِـن كاترينا 🥺💘."," زواجك مِـن لينا جونامي 🥺💘."," زواجك مِـن اسراء العبيدي 🥺💘."," زواجك مِـن سهير صلاح 🥺💘."," زواجك مِـن سولاف جليل 🥺💘."," زواجك مِـن رغد خاتون 🥺"," زواجك مِـن اساور عزت",]
zogona1 = [ " زواجج مِـن نور الزين 🥺💘."," زواجج مِـن باريش أردش 🥺💘."," زواجج مِـن محمد السالم 🥺💘."," زواجج مِـن بوراك دينيز 🥺💘."," زواجج مِـن تولغا ساريتاش 🥺💘."," زواجج مِـن كيفانش تاتليتوغ 🥺💘."," زواجج مِـن الب نفروز 🥺💘."," زواجج مِـن كولي 🥺💘."," زواجج مِـن ديراج دوبار 🥺💘."," زواجج مِـن زاك 🥺💘."," زواجج مِـن عبود 🥺💘."," زواجج مِـن محمد رمضان 🥺💘."," زواجج مِـن رامز 🥺💘."," زواجج مِـن محمد اياد 🥺💘."," زواجج مِـن محمود الغياث 🥺💘."," زواجج مِـن محمود التركي 🥺💘."," زواجج مِـن توم كروز 🥺💘. زواجج مِـن ريبر 🥺💘."," زواجج مِـن تيمور 🥺💘."," زواجج مِـن احمد البياتي 🥺💘."," زواجج مِـن كاضم الساهر 🥺💘."," زواجج مِـن مارتن 🥺💘."," زواجج مِـن احمد نسيم 🥺💘."," زواجج مِـن علي الخالدي 🥺💘."," زواجج مِـن احمد البشير 🥺💘."," زواجج مِـن علي عذاب 🥺💘."," زواجج مِـن مرتضى اركان 🥺💘."," زواجج مِـن نور مار 🥺💘."," زواجج مِـن اترو 🥺💘.",]
rksla = [ "اشغلڪ ساجدۿ عبيد ؟ 😹💕","احنه بيا حال وانته تريد تركص 😒.","شحجي وياك؟","خاله يم علي ، يم علي خاله 💃😹.","صمونن عشرهه بلف ، علي الله احترڪنة 😹.","الله الله الله وياك ، روح روح شعر شعر 😹💕.","وحبوبه شهرتينه دلبسي لـ 😹😹☹️.","على الون روحي متعلمه 🤦‍♀️💕.","العب دءلعب العب العب العب 💃💃💕","شنتنتوري 😂😂","راح اسجل روحي بأسمك 🥺","شرب شرب شرب 😎😹.","شكلولك مفتح ملهى 😒","مبينه ركاصه 😒💓.","اي شعليه متركصين 😹.","روحي صلي بدال متركصين 🤦‍♀️☹️.","توڪع ، هوه انته توڪع جرح 🥺🌈.","ربي رزقني بفد عشڪ 💕.","راح اسجل روحي بأسمك 🥺.","لسوي لمحد مسوي وادك لصبح جوبيه 💃😹😹.","اضحك عفتني بضيم اه يالعفتني ","يااول عشك وحب من صدك يجيري ويه احساسي 🤤💞.","عشڪ موت ، اموتن بيك يالغالي 🥺💓.","قافل على حبك صدك قافل ، اعشكنك عشگ جاهل 💌💗.","دايخ بيك ، احبڪ ياوجع راسي ☹️🖤.","دكافي يمعود وينك وين الركص 😒","واريد اشرد بيڪ ، يماا 😹😹",]
tbshal = [ "شوكلك هوه انته هم حاسب نفسك انسان 🙂💕","شتريد اوكلك يعمريي 🥺💞","شسويلك يعني؟ 😒","هاك بيتزا و ولي 🍕","يطبك مرض 🙂","اروحح فدوا للجوعان اني 🥺❤️","شكلولك عليه مفتح مطعم؟ ","جيب فلوس 🌚","روحي سوي اندومي 🍜💛","هاج فستق 🥜","اصلا حرام بيك الاكل انته 😒","مفتح مطعم ابوك ؟","جوع البلوع 😂😞","تريد سم؟","زربه عليك 🌚😹","خلسويلك لفه طماطه وخيار 🍅🥒","بشرفي تستاهل 🧄","هاج بركر 🍔","هاك صاج 🌯","خلسويلك بيض 🍳","مااكدر انطيج كيك لان ماكو كيك ياكل كيك 🥺💞","هاج موطه 🍦","خلسويلك دولمه 💕","خلسويلك قوزي ☹️❤️","تريد كباب 💞","راح اسويلك دجاج ع الفحم 😞😹","تريد سمج ؟","انته حليب متستاهل 😞","اسلكلك بيض؟","عدنه بس جاي 🙂","شلونك 😹","والله اني هم جوعان شتكول نروح للمطعم ع حسابك 😹😞","تريدين نمبر وان 🥺","تريدين تويكس ؟💕","تريدين جبس ♥️","عدنه تكه بايته تريدين؟ 🙂","عدنه بس باجه 🥺😹","تريد تمن احمر؟ 🤤💕","تريد تمن ومرك؟ 💕","خلسويلك طماطه حمس 🥺🙊","تريدين دليميه؟ ☹️🖤","هاج جكاره 🚬 شسوين بالاكل .","دولي 😒","وفف اسويلج مقلوبا 🙊🤤.","تريدين كبد 🤷🏻‍♀️👨‍🍳.","تريد طرشي 🌚😎","تريدين ليز ؟ 😉🧀.","تريدين تاجينا ؟","اكو مخلمه بس .","فنڪر تريدين 🥺","اسويلڪ بتيته وبيض 🤤💞.","ستسڪ لحم ، لو ستيڪ دجاج؟ 🌚.","عدنه بس برياني 🤤","تريدين حب .","اكو بس شامية ","اجيبلج فاصوليا وتمن😞💞","اسويلج كيمر وجاي؟",]
@iqthon.iq_cmd(pattern="حفض توجيه$")
async def saf(e):
    x = await e.get_reply_message()
    if not x:
        return await eod(            e, "قم بالرد على أي رسالة لحفظها في رسائلك المحفوظة", time=5        )
    if e.out:
        await x.forward_to("me")
    else:
        await x.forward_to(e.sender_id)
    await eor(e, "تم حفظ الرسالة.", time=5)

@iqthon.on(admin_cmd(pattern="اوصفلي(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    user, custom = await get_user_from_event(mention)
    if not user:
        return
    if user.id == 1226408155:
        return await edit_or_reply(mention, f"**- تاج راسك  هذا مبرمج السورس  **")
    iqth = user.first_name.replace("\u2060", "") if user.first_name else user.username
    iqt = random.choice(osfle)
    await edit_or_reply(mention, f"هذا  [{iqth}](tg://user?id={user.id}) {iqt} ")
@iqthon.on(admin_cmd(pattern="مهنته(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    user, custom = await get_user_from_event(mention)
    if not user:
        return
    if user.id == 1226408155:
        return await edit_or_reply(mention, f"**- تاج راسك  هذا مبرمج السورس  **")
    iqth = user.first_name.replace("\u2060", "") if user.first_name else user.username
    iqt = random.choice(shazla)
    await edit_or_reply(mention, f"هذا  [{iqth}](tg://user?id={user.id}) شغله {iqt} ")
@iqthon.on(admin_cmd(pattern="زوجه(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    user, custom = await get_user_from_event(mention)
    if not user:
        return
    if user.id == 1226408155:
        return await edit_or_reply(mention, f"**- تاج راسك  هذا مبرمج السورس متزوج ويه اختك  **")
    iqth = user.first_name.replace("\u2060", "") if user.first_name else user.username
    iqt = random.choice(zogona2)
    await edit_or_reply(mention, f"مبࢪوڪ [{iqth}](tg://user?id={user.id}) {iqt} ")
@iqthon.on(admin_cmd(pattern="زوجها(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    user, custom = await get_user_from_event(mention)
    if not user:
        return
    if user.id == 1226408155:
        return await edit_or_reply(mention, f"**- تاج راسك  هذا مبرمج السورس متزوج ويه اختك  **")
    iqth = user.first_name.replace("\u2060", "") if user.first_name else user.username
    iqt = random.choice(zogona1)
    await edit_or_reply(mention, f"مبࢪوڪ [{iqth}](tg://user?id={user.id}) {iqt} ")
@iqthon.on(admin_cmd(pattern="ركصله(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    user, custom = await get_user_from_event(mention)
    if not user:
        return
    if user.id == 1226408155:
        return await edit_or_reply(mention, f"**- تاج راسك  هذا مبرمج السورس     **")
    iqth = user.first_name.replace("\u2060", "") if user.first_name else user.username
    iqt = random.choice(rksla)
    await edit_or_reply(mention, f" [{iqth}](tg://user?id={user.id}) {iqt} ")
@iqthon.on(admin_cmd(pattern="طبخله(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    user, custom = await get_user_from_event(mention)
    if not user:
        return
    if user.id == 1226408155:
        return await edit_or_reply(mention, f"**- تاج راسك  هذا مبرمج السورس     **")
    iqth = user.first_name.replace("\u2060", "") if user.first_name else user.username
    iqt = random.choice(tbshal)
    await edit_or_reply(mention, f" [{iqth}](tg://user?id={user.id}) {iqt} ")
@iqthon.on(admin_cmd(pattern="رموز1(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""`𓅄 𓅅 𓅆 𓅇 𓅈 𓅉 𓅊 𓅋 𓅌 𓅍 𓅎 𓅏 𓅐 𓅑 𓅒 𓅓 𓅔𓅕 𓅖 𓅗 𓅘 𓅙 𓅚 𓅛 𓅜 𓅝 𓅞 𓅟 𓅠 𓅡 𓅢 𓅣 𓅤 𓅥 𓅦 𓅧 𓅨 𓅩 𓅫 𓅬 𓅭 𓅮 𓅯 𓅰 𓅱 𓅲 𓅳 𓅴 
𓅵 𓅶 𓅷 𓅸 𓅹 𓅺 𓅻 
 ☤ 𓅾 𓅿 𓆀 𓆁 𓆂
𓀀 𓀁 𓀂 𓀃 𓀄 𓀅 𓀆 𓀇 𓀈 𓀉 𓀊 𓀋 𓀌 𓀍 𓀎 𓀏 𓀐 𓀑 𓀒 𓀓 𓀔 𓀕 𓀖 𓀗 𓀘 𓀙 𓀚 𓀛 𓀜 𓀝 𓀞 𓀟 𓀠 𓀡 𓀢 𓀣 𓀤 𓀥 𓀦 𓀧 𓀨 𓀩 𓀪 𓀫 𓀬 𓀭 𓀮 𓀯 𓀰 𓀱 𓀲 𓀳 𓀴 𓀵 𓀶 𓀷 𓀸 𓀹 𓀺 𓀻 𓀼 𓀽 𓀾 𓀿 𓁀 𓁁 𓁂 𓁃 𓁄 𓁅 𓁆 𓁇 𓁈 𓁉 𓁊 𓁋 𓁌 𓁍 𓁎 𓁏 𓁐 𓁑 𓁒 𓁓 𓁔 𓁕 𓁖 𓁗 𓁘 𓁙 𓁚 𓁛 𓁜 𓁝 𓁞 𓁟 𓁠 𓁡 𓁢 𓁣 𓁤 𓁥 𓁦 𓁧 𓁨 𓁩 𓁪 𓁫 𓁬 𓁭 𓁮 𓁯 𓁰 𓁱 𓁲 𓁳 𓁴 𓁵 𓁶 𓁷 𓁸 𓁹 𓁺 𓁻 𓁼 𓁽 𓁾 𓁿 𓂀𓂅 𓂆 𓂇 𓂈 𓂉 𓂊 𓂋 𓂌 𓂍 𓂎 𓂏 𓂐 𓂑 𓂒 𓂓 𓂔 𓂕 𓂖 𓂗 𓂘 𓂙 𓂚 𓂛 𓂜 𓂝 𓂞 𓂟 𓂠 𓂡 𓂢 𓂣 𓂤 𓂥 𓂦 𓂧 𓂨 𓂩 𓂪 𓂫 𓂬 𓂭 𓂮 𓂯 𓂰 𓂱 𓂲 𓂳 𓂴 𓂵 𓂶 𓂷 𓂸 𓂹 𓂺 𓂻 𓂼 𓂽 𓂾 𓂿 𓃀 𓃁 𓃂 𓃃 𓃅 𓃆 𓃇 𓃈 𓃉 𓃊 𓃋 𓃌 𓃍 𓃎 𓃏 𓃐 𓃑 𓃒 𓃓 𓃔 𓃕 𓃖 𓃗 𓃘 𓃙 𓃚 𓃛 𓃜 𓃝 𓃞 𓃟 𓃠 𓃡 𓃢 𓃣 𓃤 𓃥 𓃦 𓃧 𓃨 𓃩 𓃪 𓃫 𓃬 𓃭 𓃮 𓃯 𓃰 𓃱 𓃲 𓃳 𓃴 𓃵 𓃶 𓃷 𓃸 𓃹 𓃺 𓃻 𓃼 𓃽 𓃾 𓃿 𓄀 𓄁 𓄂 𓄃 𓄄 𓄅 𓄆 𓄇 𓄈 𓄉 𓄊 𓄋 𓄌 𓄍 𓄎 𓄏 𓄐 𓄑 𓄒 𓄓 𓄔 𓄕 𓄖 𓄙 𓄚 𓄛 𓄜 𓄝 𓄞 𓄟 𓄠 𓄡 𓄢 𓄣 𓄤 𓄥 𓄦 𓄧 𓄨 𓄩 𓄪 𓄫 𓄬 𓄭 𓄮 𓄯 𓄰 𓄱 𓄲 𓄳 𓄴 𓄵 𓄶 𓄷 𓄸 𓄹 𓄺   𓄼 𓄽 𓄾 𓄿 𓅀 𓅁 𓅂 𓅃 𓅄 𓅅 𓅆 𓅇 𓅈 𓅉 𓅊 𓅋 𓅌 𓅍 𓅎 𓅏 𓅐 𓅑 𓅒 𓅓 𓅔 𓅕 𓅖 𓅗 𓅘 𓅙 𓅚 𓅛 𓅜 𓅝 𓅞 𓅟 𓅠 𓅡 𓅢 𓅣 𓅤 𓅥 𓅦 𓅧 𓅨 𓅩 𓅪 𓅫 𓅬 𓅭 𓅮 𓅯 𓅰 𓅱 𓅲 𓅳 𓅴 𓅵 𓅶 𓅷 𓅸 𓅹 𓅺 𓅻 𓅼 𓅽 𓅾 𓅿 𓆀 𓆁 𓆂 𓆃 𓆄 𓆅 𓆆 𓆇 𓆈 𓆉 𓆊 𓆋 𓆌 𓆍 𓆎 𓆐 𓆑 𓆒 𓆓 𓆔 𓆕 𓆖 𓆗 𓆘 𓆙 𓆚 𓆛 𓆜 𓆝 𓆞 𓆟 𓆠 𓆡 𓆢 𓆣 𓆤 𓆥 𓆦 𓆧 𓆨 𓆩𓆪 𓆫 𓆬 𓆭 𓆮 𓆯 𓆰 𓆱 𓆲 𓆳 𓆴 𓆵 𓆶 𓆷 𓆸 𓆹 𓆺 𓆻 𓆼 𓆽 𓆾 𓆿 𓇀 𓇁 𓇂 𓇃 𓇄 𓇅 𓇆 𓇇 𓇈 𓇉 𓇊 𓇋 𓇌 𓇍 𓇎 𓇏 𓇐 𓇑 𓇒 𓇓 𓇔 𓇕 𓇖 𓇗 𓇘 𓇙 𓇚 𓇛 𓇜 𓇝 𓇞 𓇟 𓇠 𓇡 𓇢 𓇣 𓇤 𓇥 𓇦 𓇧 𓇨 𓇩 𓇪 𓇫 𓇬 𓇭 𓇮 𓇯 𓇰 𓇱 𓇲 𓇳 𓇴 𓇵 𓇶 𓇷 𓇸 𓇹 𓇺 𓇻 𓇼 𓇾 𓇿 𓈀 𓈁 𓈂 𓈃 𓈄 𓈅 𓈆 𓈇 𓈈 𓈉 𓈊 𓈋 𓈌 𓈍 𓈎 𓈏 𓈐 𓈑 𓈒 𓈓 𓈔 𓈕 𓈖 𓈗 𓈘 𓈙 𓈚 𓈛 𓈜 𓈝 𓈞 𓈟 𓈠 𓈡 𓈢 𓈣 𓈤  𓈥 𓈦 𓈧 𓈨 𓈩 𓈪 𓈫 𓈬 𓈭 𓈮 𓈯 𓈰 𓈱 𓈲 𓈳 𓈴 𓈵 𓈶 𓈷 𓈸 𓈹 𓈺 𓈻 𓈼 𓈽 𓈾 𓈿 𓉀 𓉁 𓉂 𓉃 𓉄 𓉅 𓉆 𓉇 𓉈 𓉉 𓉊 𓉋 𓉌 𓉍 𓉎 𓉏 𓉐 𓉑 𓉒 𓉓 𓉔 𓉕 𓉖 𓉗 𓉘 𓉙 𓉚 𓉛 𓉜 𓉝 𓉞 𓉟 𓉠 𓉡 𓉢 𓉣 𓉤 𓉥 𓉦 𓉧 𓉨 𓉩 𓉪 𓉫 𓉬 𓉭 𓉮 𓉯 𓉰 𓉱 𓉲 𓉳 𓉴 𓉵 𓉶 𓉷 𓉸 𓉹 𓉺 𓉻 𓉼 𓉽 𓉾 𓉿 𓊀 𓊁 𓊂 𓊃 𓊄 𓊅 𓊈 𓊉 𓊊 𓊋 𓊌 𓊍 𓊎 𓊏 𓊐 𓊑 𓊒 ?? 𓊔 𓊕 ?? ?? 𓊘 𓊙 𓊚 𓊛 𓊜 𓊝 𓊞 𓊟 𓊠 𓊡 𓊢 𓊣 𓊤 𓊥 𓊦 𓊧 𓊨 𓊩 𓊪 𓊫 𓊬 𓊭 𓊮 𓊯 𓊰 𓊱 𓊲 𓊳 𓊴 𓊵 𓊶 𓊷 𓊸 𓊹 𓊺 𓊻 𓊼 ?? ?? 𓊿 𓋀 𓋁 𓋂 𓋃 𓋄 𓋅 𓋆 𓋇 𓋈 𓋉 𓋊 𓋋 𓋌 𓋍 𓋎 𓋏 𓋐 𓋑 𓋒 𓋓 𓋔 𓋕 𓋖 𓋗 𓋘 𓋙 𓋚 𓋛 𓋜 𓋝 𓋞 𓋟 𓌰 𓌱 𓌲 𓌳 𓌴 𓌵 𓌶 𓌷 𓌸 𓌹 𓌺 𓌻 𓌼 𓌽 𓌾 𓌿 𓍀 𓍁 𓍂 𓍃 𓍄 𓍅 𓍆 𓍇 𓍈 𓍉 𓍊 𓍋 𓍌 𓍍 𓍎 𓍏 𓍐 𓍑 𓍒 𓍓 𓍔 𓍕 𓍖 𓍗 𓍘 𓍙 𓍚 𓍛 𓍜 𓍝 𓍞 𓍟 𓍠 𓍡 𓍢 𓍣 𓍤 𓍥 𓍦 𓍧 𓍨 𓍩 𓍪 𓍫 𓍬 𓍭 𓍮 𓍯 𓍰 𓍱 𓍲 𓍳 𓍴 𓍵 𓍶 𓍷 𓍸 𓍹 𓍺 𓍻 𓍼 𓍽 𓍾 𓍿 𓎀 𓎁 𓎂 𓎃 𓎄 𓎅 𓎆 𓎇 𓎈 𓎉 𓎊 𓎋 𓎌 𓎍 𓎎 𓎏 𓎐 𓎑 𓎒 𓎓 𓎔 𓎕 𓎖 𓎗 𓎘 𓎙 𓎚 𓎛 𓎜 𓎝 𓎞 𓎟 𓎠 𓎡 𓏋 𓏌 𓏍 𓏎 𓏏 𓏐 𓏑 𓏒 𓏓 
 𓏕 𓏖 𓏗 𓏘 𓏙 𓏚 𓏛 𓏜 𓏝 𓏞 𓏟 𓏠 𓏡 𓏢 𓏣 𓏤 𓏥 𓏦 𓏧 𓏨 𓏩 𓏪 𓏫 𓏬 𓏭 𓏮 𓏯 𓏰 𓏱 𓏲 𓏳 𓏴 𓏶 𓏷 𓏸 𓏹 𓏺 𓏻 𓏼 𓏽 𓏾 𓏿 𓐀 𓐁 𓐂 𓐃 𓐄 𓐅 𓐆
- 𖣨 ، ෴ ، 𖡺  ، 𖣐 ، ✜ ، ✘ ، 𖡻 ،
- ༄ ، ༺༻ ، ༽༼ ،  ╰☆╮،  
- ɵ̷᷄ˬɵ̷᷅ ، ⠉̮⃝ ، ࿇࿆ ، ꔚ، ま ، ☓ ،
𓆉 . 𓃠 .𓅿 . 𓃠 . 𓃒 . 𓅰 . 𓃱 . 𓅓 . 𐂃  . ꕥ  . ⌘ . ♾ .    ꙰  .  . ᤑ .  ﾂ .
✦ ,✫ ,✯, ✮ ,✭ ,✰, ✬ ,✧, ✤, ❅ , 𒀭,✵ , ✶ , ✷ , ✸ , ✹ ,⧫, . 𐂂 
-〘 𖢐 ، 𒍦 ، 𒍧 ، 𖢣 ، 𝁫 ، 𒍭 ، 𝁅 ، 𝁴 ، 𒍮 ، 𝁵 ، 𝀄 ، 𓏶 ، 𓏧 ، 𓏷 ، 𓏯 ، 𓏴 ، 𓏳 ، 𓏬 ، 𓏦 ، 𓏵 ، 𓏱 ، ᳱ ، ᯼ ، 𐃕 ، ᯥ ، ᯤ ، ᯾ ، ᳶ ، ᯌ ، ᢆ ،
 ᥦ ، ᨙ ، ᨚ  ، ᨔ  ، ⏢ ، ⍨ ، ⍃ ، ⏃ ، ⍦ ، ⏕ ، ⏤ ، ⏁ ، ⏂ ، ⏆ ، ⌳ ، ࿅ ، ࿕ ، ࿇ ، ᚙ ، ࿊ ، ࿈ ، ྿ ،
 ࿂ ، ࿑ ،  ᛥ ، ࿄ ، 𐀁 ، 𐀪 ، 𐀔 ، 𐀴 ، 𐀤 ، 𐀦 ، 𐀂 ، 𐀣 ، 𐀢 ، 𐀶 ، 𐀷 ، 𐂭 ، 𐂦 ، 𐂐 ، 𐂅 ، 𐂡 ، 𐂢 ، 𐂠 ، 𐂓 ، 𐂑 ، 𐃸 ، 𐃶 ، 𐂴 ، 𐃭 ، 𐃳 ، 𐃣 ، 𐂰 ، 𐃟 ، 𐃐 ، 𐃙 ، 𐃀 ، 𐇮 ، 𐇹 ، 𐇲 ، 𐇩 ، 𐇪 ، 𐇶 ، 𐇻 ، 𐇡 ، 𐇸 ، 𐇣 ، 𐇤 ، 𐎅 ، 𐏍 ، 𐎃 ، 𐏒 ، 𐎄 ، 𐏕 〙.
╔ ╗. 𓌹  𓌺 .〝  〞. ‹ ›  .「  」.〖 〗. 《》 .  < > . « »  . ﹄﹃
₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₀
𝟏 𝟐 𝟑 𝟒 𝟓 𝟔 𝟕 𝟖 𝟗 𝟎
𝟭 𝟮 𝟯 𝟰 𝟱 𝟲 𝟳 𝟴 𝟵 𝟬
①②③④⑤⑥⑦⑧⑨⓪
❶❷❸❹❺❻❼❽❾⓿
⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴ `""")
@iqthon.on(admin_cmd(pattern="رموز2(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""`———————×———————
 𝟶 𝟷 𝟸 𝟹 𝟺 𝟻 𝟼 𝟽 𝟾  𝟿
 ? 𝟙  𝟚  𝟛  𝟜  𝟝  𝟞  𝟟  𝟠 𝟡
 𝟬 𝟭  𝟮  𝟯  𝟰  𝟱   𝟲  𝟳  𝟴  𝟵  
 𝟎  𝟏  𝟐  𝟑  𝟒   𝟓   𝟔  𝟕   𝟖   𝟗
０ １ ２ ３ ４ ５ ６ ７８９
———————×———————
ᾋ ᾌ ᾍ ᾎ ᾏ ᾐ ᾑ ᾒ ᾓ ᾔ ᾕ ᾖ ᾗ ᾘ ᾙ ᾚ ᾛ ᾜ ᾝ ᾞ ᾟ ᾠ ᾡ ᾢ ᾣ ᾤ ᾥ ᾦ ᾧ ᾨ ᾩ ᾪ ᾫ ᾬ ᾭ ᾮ ᾯ ᾰ ᾱ ᾲ ᾳ ᾴ ᾶ ᾷ Ᾰ Ᾱ Ὰ Ά ᾼ ᾽ ι ᾿ ῀ ῁ ῂ ῃ ῄ ῆ ῇ Ὲ Έ Ὴ Ή ῌ ῍ ῎ ῏ ῐ ῑ ῒ ΐ ῖ ῗ Ῐ Ῑ Ὶ Ί ῝ ῞ ῟ ῠ ῡ ῢ ΰ ῤ ῥ ῦ ῧ Ῠ Ῡ Ὺ Ύ Ῥ ῭ ΅ ` ῲ ῳ ῴ ῶ ῷ Ὸ Ό Ὼ Ώ ῼ ´ ῾ ῿                         ‌ ‍ ‎ ‏ ‐ ‑ ‒ – — ― ‖ ‗ ‘ ’ ‚ ‛ “ ” „ ‟ † ‡ • ‣ ․ ‥ … ‧       ‰ ‱ ′ ″ ‴ ‵ ‶ ‷ ‸ ‹ › ※  ‽ ‾ ‿ ⁀ ⁁ ⁂ ⁃ ⁄ ⁅ ⁆ ⁇  ⁊ ⁋ ⁌ ⁍ ⁎ ⁏ ⁐ ⁑ ⁒ ⁓ ⁔ ⁕ ⁖ ⁗ ⁘ ⁙ ⁚ ⁛ ⁜ ⁝ ⁞   ⁠ ⁡ ⁢ ⁣ ⁤ ⁥ ‌ ‌ ⁨ ⁩ ⁪ ⁫ ⁬ ⁭ ⁮ ⁯ ⁰ ⁱ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ⁿ ₀ ₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₐ ₑ ₒ ₓ ₕ ₖ ₗ ₘ ₙ ₚ ₛ ₜ ₝ ₞ ₟ ₠ ₡ ₢ ₣ ₤ ₥ ₦ ₧ ₨ ₩ ₪ ₫ € ₭ ₮ ₯ ₰ ₱ ₲ ₳ ₴ ₵ ℀ ℁ ℂ ℃ ℄ ℅ ℆ ℇ ℈ ℉ ℊ ℋ ℌ ℍ ℎ ℏ ℐ ℑ ℒ ℓ ℔ ℕ № ℗ ℘ ℙ ℚ ℛ ℜ ℝ ℞ ℟ ℠ ℡ ™ ℣ ℤ ℥ Ω ℧ ℨ ℩ K Å ℬ ℭ ℮ ℯ ℰ ℱ Ⅎ ℳ ℴ ℵ ℶ ℷ ℸ  ℺ ℻ ℼ ℽ ℾ ℿ ⅀ ⅁ ⅂ ⅃ ⅄ ⅅ ⅆ ⅇ ⅈ ⅉ ⅊ ⅋ ⅌ ⅍ ⅎ ⅏ ⅐ ⅑ ⅒ ⅓ ⅔ ⅕ ⅖ ⅗ ⅘ ⅙ ⅚ ⅛ ⅜ ⅝ ⅞ ↀ ↁ ↂ Ↄ ↉ ↊ ↋ ← ↑ → ↓  ↚ ↛ ↜ ↝ ↞ ↟ ↠ ↡ ↢ ↣ ↤ ↥ ↦ ↧ ↨  ↫ ↬ ↭ ↮ ↯ ↰ ↱ ↲ ↳ ↴ ↵ ↶ ↷ ↸ ↹ ↺ ↻ ↼ ↽ ↾ ↿ ⇀ ⇁ ⇂ ⇃ ⇄ ⇅ ⇆ ⇇ ⇈ ⇉ ⇊ ⇋ ⇌ ⇍ ⇎ ⇏ ⇐ ⇑ ⇒ ⇓ ⇔ ⇕ ⇖ ⇗ ⇘ ⇙ ⇚ ⇛ ⇜ ⇝ ⇞ ⇟ ⇠ ⇡ ⇢ ⇣ ⇤ ⇥ ⇦ ⇧ ⇨ ⇩ ⇪ ⇫ ⇬ ⇭ ⇮ ⇯ ⇰ ⇱ ⇲ ⇳ ⇴ ⇵ ⇶ ⇷ ⇸ ⇹ ⇺ ⇻ ⇼ ⇽ ⇾ ⇿ ∀ ∁ ∂ ∃ ∄ ∅ ∆ ∇ ∈ ∉ ∊ ∋ ∌ ∍ ∎ ∏ ∐ ∑ − ∓ ∔ ∕ ∖ ∗ ∘ ∙ √ ∛ ∜ ∝ ∞ ∟ ∠ ∡ ∢ ∣ ∤ ∥ ∦ ∧ ∨ ∩ ∪ ∫ ∬ ∭ ∮ ∯ ∰ ∱ ∲ ∳ ∴ ∵ ∶ ∷ ∸ ∹ ∺ ∻ ∼ ∽ ∾ ∿ ≀ ≁ ≂ ≃ ≄ ≅ ≆ ≇ ≈ ≉ ≊ ≋ ≌ ≍ ≎ ≏ ≐ ≑ ≒ ≓ ≔ ≕ ≖ ≗ ≘ ≙ ≚ ≛ ≜ ≝ ≞ ≟ ≠ ≡ ≢ ≣ ≤ ≥ ≦ ≧ ≨ ≩ ≪ ≫ ≬ ≭ ≮ ≯ ≰ ≱ ≲ ≳ ≴ ≵ ≶ ≷ ≸ ≹ ≺ ≻ ≼ ≽ ≾ ≿ ⊀ ⊁ ⊂ ⊃ ⊄ ⊅ ⊆ ⊇ ⊈ ⊉ ⊊ ⊋ ⊌ ⊍ ⊎ ⊏ ⊐ ⊑ ⊒ ⊓ ⊔ ⊕ ⊖ ⊗ ⊘ ⊙ ⊚ ⊛ ⊜ ⊝ ⊞ ⊟ ⊠ ⊡ ⊢ ⊣ ⊤ ⊥ ⊦ ⊧ ⊨ ⊩ ⊪ ⊫ ⊬ ⊭ ⊮ ⊯ ⊰ ⊱ ⊲ ⊳ ⊴ ⊵ ⊶ ⊷ ⊸ ⊹ ⊺ ⊻ ⊼ ⊽ ⊾ ⊿ ⋀ ⋁ ⋂ ⋃ ⋄ ⋅ ⋆ ⋇ ⋈ ⋉ ⋊ ⋋ ⋌ ⋍ ⋎ ⋏ ⋐ ⋑ ⋒ ⋓ ⋔ ⋕ ⋖ ⋗ ⋘ ⋙ ⋚ ⋛ ⋜ ⋝ ⋞ ⋟ ⋠ ⋡ ⋢ ⋣ ⋤ ⋥ ⋦ ⋧ ⋨ ⋩ ⋪ ⋫ ⋬ ⋭ ⋮ ⋯ ⋰ ⋱ ⋲ ⋳ ⋴ ⋵ ⋶ ⋷ ⋸ ⋹ ⋺ ⋻ ⋼ ⋽ ⋾ ⋿ ⌀ ⌁ ⌂ ⌃ ⌄ ⌅ ⌆ ⌇ ⌈ ⌉ ⌊ ⌋ ⌌ ⌍ ⌎ ⌏ ⌐ ⌑ ⌒ ⌓ ⌔ ⌕ ⌖ ⌗ ⌘ ⌙  ⌛️ ⌜ ⌝ ⌞ ⌟ ⌠ ⌡ ⌢ ⌣ ⌤ ⌥ ⌦ ⌧ ⌨️ 〈 〉 ⌫ ⌬ ⌭ ⌮ ⌯ ⌰ ⌱ ⌲ ⌳ ⌴ ⌵ ⌶ ⌷ ⌸ ⌹ ⌺ ⌻ ⌼ ⌽ ⌾ ⌿ ⍀ ⍁ ⍂ ⍃ ⍄ ⍅ ⍆ ⍇ ⍈ ⍉ ⍊ ⍋ ⍌ ⍍ ⍎ ⍏ ⍐ ⍑ ⍒ ⍓ ⍔ ⍕ ⍖ ⍗ ⍘ ⍙ ⍚ ⍛ ⍜ ⍝ ⍞ ⍟ ⍠ ⍡ ⍢ ⍣ ⍤ ⍥ ⍦ ⍧ ⍨ ⍩ ⍪ ⍫ ⍬ ⍭ ⍮ ⍯ ⍰ ⍱ ⍲ ⍳ ⍴ ⍵ ⍶ ⍷ ⍸ ⍹ ⍺ ⍻ ⍼ ⍽ ⍾ ⍿ ⎀ ⎁ ⎂ ⎃ ⎄ ⎅ ⎆ ⎇ ⎈ ⎉ ⎊ ⎋ ⎌ ⎍ ⎎ ⎏ ⎐ ⎑ ⎒ ⎓ ⎔ ⎕ ⎖ ⎗ ⎘ ⎙ ⎚ ⎛ ⎜ ⎝ ⎞ ⎟ ⎠ ⎡ ⎢ ⎣ ⎤ ⎥ ⎦ ⎧ ⎨ ⎩ ⎪ ⎫ ⎬ ⎭ ⎮ ⎯ ⎰ ⎱ ⎲ ⎳ ⎴ ⎵ ⎶ ⎷ ⎸ ⎹ ⎺ ⎻ ⎼ ⎽ ⎾ ⎿ ⏀ ⏁ ⏂ ⏃ ⏄ ⏅ ⏆ ⏇ ⏈ ⏉ ⏋ ⏌ ⏍ ⏎  ⏐ ⏑ ⏒ ⏓ ⏔ ⏕ ⏖ ⏗ ⏘ ⏙ ⏚ ⏛ ⏜ ⏝ ⏞ ⏟ ⏠ ⏡ ⏢ ⏣ ⏤ ⏥ ⏦ ␋ ␢ ␣ ① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ⑩ ⑪ ⑫ ⑬ ⑭ ⑮ ⑯ ⑰ ⑱ ⑲ ⑳ ⑴ ⑵ ⑶ ⑷ ⑸ ⑹ ⑺ ⑻ ⑼ ⑽ ⑾ ⑿ ⒀ ⒁ ⒂ ⒃ ⒄ ⒅ ⒆ ⒇ ⒈ ⒉ ⒊ ⒋ ⒌ ⒍ ⒎ ⒏ ⒐ ⒑ ⒒ ⒓ ⒔ ⒕ ⒖ ⒗ ⒘ ⒙ ⒚ ⒛ ⒜ ⒝ ⒞ ⒟ ⒠ ⒡ ⒢ ⒣ ⒤ ⒥ ⒦ ⒧ ⒨ ⒩ ⒪ ⒫ ⒬ ⒭ ⒮ ⒯ ⒰ ⒱ ⒲ ⒳ ⒴ ⒵ Ⓐ Ⓑ Ⓒ Ⓓ Ⓔ Ⓕ Ⓖ Ⓗ Ⓘ Ⓙ Ⓚ Ⓛ  Ⓝ Ⓞ Ⓟ Ⓠ Ⓡ Ⓢ Ⓣ Ⓤ Ⓥ Ⓦ Ⓧ Ⓨ Ⓩ ⓐ ⓑ ⓒ ⓓ ⓔ ⓕ ⓖ ⓗ ⓘ ⓙ ⓚ ⓛ ⓜ ⓝ ⓞ ⓟ ⓠ ⓡ ⓢ ⓣ ⓤ ⓥ ⓦ ⓧ ⓨ ⓩ ⓪ ⓫ ⓬ ⓭ ⓮ ⓯ ⓰ ⓱ ⓲ ⓳ ⓴ ⓵ ⓶ ⓷ ⓸ ⓹ ⓺ ⓻ ⓼ ⓽ ⓾ ⓿ ─ ━ │ ┃ ┄ ┅ ┆ ┇ ┈ ┉ ┊ ┋ ┌ ┍ ┎ ┏ ┐ ┑ ┒ ┓ └ ┕ ┖ ┗ ┘ ┙ ┚ ┛ ├ ┝ ┞ ┟ ┠ ┡ ┢ ┣ ┤ ┥ ┦ ┧ ┨ ┩ ┪ ┫ ┬ ┭ ┮ ┯ ┰ ┱ ┲ ┳ ┴ ┵ ┶ ┷ ┸ ┹ ┺ ┻ ┼ ┽ ┾ ┿ ╀ ╁ ╂ ╃ ╄ ╅ ╆ ╇ ╈ ╉ ╊ ╋ ╌ ╍ ╎ ╏ ═ ║ ╒ ╓ ╔ ╕ ╖ ╗ ╘ ╙ ╚ ╛ ╜ ╝ ╞ ╟ ╠ ╡ ╢ ╣ ╤ ╥ ╦ ╧ ╨ ╩ ╪ ╫ ╬ ╬﹌ ╭ ╮ ╯ ╰ ╰☆╮ ╱ ╲ ╳ ╴ ╵ ╶ ╷ ╸ ╹ ╺ ╻ ╼ ╽ ╾ ╿ ▀ ▁ ▂ ▃ ▄ ▅ ▆ ▇ █ ▉ ▊ ▋ ▌ ▍ ▎ ▏ ▐ ░ ▒ ▓ ▔ ▕ ▖ ▗ ▘ ▙ ▚ ▛ ▜ ▝ ▞ ▟ ■ □ ▢ ▣ ▤ ▥ ▦ ▧ ▨ ▩ ▪️ ▫️ ▬ ▭ ▮ ▯ ▰ ▱ ▲ △ ▴ ▵ ▷ ▸ ▹ ► ▻ ▼ ▽ ▾ ▿  ◁ ◂ ◃ ◄ ◅ ◆ ◇ ◈ ◉ ◊ ○ ◌ ◍ ◎ ● ◐ ◑ ◒ ◓ ◔ ◔ʊ ◕ ◖ ◗ ◘ ◙ ◚ ◛ ◜ ◝ ◞ ◟ ◠ ◡ ◢ ◣ ◤ ◥ ◦ ◧ ◨ ◩ ◪ ◫ ◬ ◭ ◮ ◯ ◰ ◱ ◲ ◳ ◴ ◵ ◶ ◷ ◸ ◹ ◺  ☓ ☰ ☱ ☲ ☳ ☴ ☵ ☶ ☷  ♡ ♢   ♰ ♱  ⚆   ⚊ ⚋ ⚌ ⚍ ⚎ ⚏  ✐ ✑  ✓ ✔️ ✕ ✖️ ✗ ✘ ✙ ✚ ✛ ✜  ✞ ✟ ✠ ✢ ✣ ✤ ✥ ✦ ✧ ✧♱ ✩ ✪ ✫ ✬ ✭ ✮ ✯ ✰ ✱ ✲  ✵ ✶ ✷ ✸ ✹ ✺ ✻ ✼ ✽ ✾ ✿ ❀ ❁ ❂ ❃ ❅ ❆ ❈ ❉ ❊ ❋ ❍ ❏ ❐ ❑ ❒ ❖  ❘ ❙ ❚ ❛ ❜ ❝ ❞ ❡ ❢ ❥ ❦ ❧ ❨ ❩ ❪ ❫ ❬ ❭ ❮ ❯ ❰ ❱ ❲ ❳ ❴ ❵ ❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ➀ ➁ ➂ ➃ ➄ ➅ ➆ ➇ ➈ ➉ ➊ ➋ ➌ ➍ ➎ ➏ ➐➑ ➒ ➓ ➔ ➘ ➙ ➚ ➛ ➜ ➝ ➞ ➟ ➠  ➢ ➣ ➤ ➥ ➦ ➧ ➨ ➩ ➪ ➫ ➬ ➭ ➮ ➯ ➱ ➲ ➳ ➴ ➵ ➶ ➷ ➸ ➹ ➺ ➻ ➼ ➽ ➾ ⟀ ⟁ ⟂ ⟃ ⟄ ⟇ ⟈ ⟉ ⟊ ⟐ ⟑ ⟒ ⟓ ⟔ ⟕ ⟖ ⟗ ⟘ ⟙ ⟚ ⟛ ⟜ ⟝ ⟞ ⟟ ⟠ ⟡ ⟢ ⟣ ⟤ ⟥ ⟦ ⟧ ⟨ ⟩ ⟪ ⟫ ⟰ ⟱ ⟲ ⟳ ⟴ ⟵ ⟶ ⟷ ⟸ ⟹ ⟺ ⟻ ⟼ ⟽ ⟾ ⟿ ⤀ ⤁ ⤂ ⤃ ⤄ ⤅ ⤆ ⤇ ⤈ ⤉ ⤊ ⤋ ⤌ ⤍ ⤎ ⤏ ⤐ ⤑ ⤒ ⤓ ⤔ ⤕ ⤖ ⤗ ⤘ ⤙ ⤚ ⤛ ⤜ ⤝ ⤞ ⤟ ⤠ ⤡ ⤢ ⤣ ⤤ ⤥ ⤦ ⤧ ⤨ ⤩ ⤪ ⤫ ⤬ ⤭ ⤮ ⤯ ⤰ ⤱ ⤲ ⤳ ⤶ ⤷ ⤸ ⤹ ⤺ ⤻ ⤼ ⤽ ⤾ ⤿ ⥀ ⥁ ⥂ ⥃ ⥄ ⥅ ⥆ ⥇ ⥈ ⥉ ⥊ ⥋ ⥌ ⥍ ⥎ ⥏ ⥐ ⥑ ⥒ ⥓ ⥔ ⥕ ⥖ ⥗ ⥘ ⥙ ⥚ ⥛ ⥜ ⥝ ⥞ ⥟ ⥠ ⥡ ⥢ ⥣ ⥤ ⥥ ⥦ ⥧ ⥨ ⥩ ⥪ ⥫ ⥬ ⥭ ⥮ ⥯ ⥰ ⥱ ⥲ ⥳ ⥴ ⥵ ⥶ ⥷ ⥸ ⥹ ⥺ ⥻ ⥼ ⥽ ⥾ ⥿ ⦀ ⦁ ⦂ ⦃ ⦄ ⦅ ⦆ ⦇ ⦈ ⦉ ⦊ ⦋ ⦌ ⦍ ⦎ ⦏ ⦐ ⦑ ⦒ ⦓ ⦔ ⦕ ⦖ ⦗ ⦘ ⦙ ⦚ ⦛ ⦜ ⦝ ⦞ ⦟ ⦠ ⦡ ⦢ ⦣ ⦤ ⦥ ⦦ ⦧ ⦨ ⦩ ⦪ ⦫ ⦬ ⦭ ⦮ ⦯ ⦰ ⦱ ⦲ ⦳ ⦴ ⦵ ⦶ ⦷ ⦸ ⦹ ⦺ ⦻ ⦼ ⦽ ⦾ ⦿ ⧀ ⧁ ⧂ ⧃ ⧄ ⧅ ⧆ ⧇ ⧈ ⧉ ⧊ ⧋ ⧌ ⧍ ⧎ ⧏ ⧐ ⧑ ⧒ ⧓ ⧔ ⧕ ⧖ ⧗ ⧘ ⧙ ⧚ ⧛ ⧜ ⧝ ⧞ ⧟ ⧡ ⧢ ⧣ ⧤ ⧥ ⧦ ⧧ ⧨ ⧩ ⧪ ⧫ ⧬ ⧭ ⧮ ⧯ ⧰ ⧱ ⧲ ⧳ ⧴ ⧵ ⧶ ⧷ ⧸ ⧹ ⧺ɷ
﹎﹎﹎﹎﹎﹎﹎﹎﹎﹎ `""")
@iqthon.on(admin_cmd(pattern="بايوهات1(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""
— — — — — — — — —
`𓆦 : أيـۿ  ◡‌ 💙🧿.
𓆦 : ذأت الـ ١٤ ؏ـام ◡‌ 💙🧿.
𓆦 : انت دائماً بقلبي وأنا دائـماً #أحبك ◡‌ 💙🧿 .`
— — — — — — — — —
`𓆦 : مَريـم  ◡‌ 🤎🦦.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🤎🦦.
𓆦 : أنت فرحة عُـمري أنت #أصدق شعور ◡‌ 🤎🦦 .`
— — — — — — — — —
`𓆦 : بَنيـن  ◡‌ 💛🍋.
𓆦 : ذأت الـ ١٦ ؏ـام ◡‌ 💛🍋.
𓆦 : ‏تسـرني إذا مريت في #بالي ◡‌ 💛🍋 .`
— — — — — — — — —
`𓆦 : ۿبـة  ◡‌ 🤍🕊.
𓆦 : ذأت الـ ٢١ ؏ـام ◡‌ 🤍🕊.
𓆦 : ‏لتكُن أصـابعي #بأمان يديك دائماً ◡‌ 🤍🕊 .`
— — — — — — — — —
`𓆦 : ﺄيـة  ◡‌ 🎈.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🎈.
𓆦 : ‏ماياخذوُنك منَي مهما #زعلنا وأخذنا البُعد ‏ ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : شۿـد  ◡‌ 🎈.
𓆦 : ذأت الـ ١٤ ؏ـام ◡‌ 🎈.
𓆦 : ‏ ‏اتمنى أن تمتلك عذراً كافٍ لكل ما تفعله معي حتى الآن . ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : زۿـࢪأء  ◡‌ 🎈.
𓆦 : ذأت الـ ١٥ ؏ـام ◡‌ 🎈.
𓆦 : ‏ #حَسباليّ تحِن تاليتك بسابعّ حضن . ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : مـينآ  ◡‌ 🎈.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🎈.
𓆦 : ‏ كافي تكابر #عيونك حچن حزنك . ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : ࢪوأن  ◡‌ 🎈.
𓆦 : ذأت الـ ١٦ ؏ـام ◡‌ 🎈.
𓆦 : ‏إذا اعتنيت #بالاشياء ، فهي تدوم .  ◡‌ 🎈.`
— — — — — — — — —
`𓆦 : رزﺄن  ◡‌ 🍇.
𓆦 : ذأت الـ ١٤ ؏ـام ◡‌ 🍇.
𓆦 : الوطن ليس مكان بل #انت  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : سَـارۿ  ◡‌ 🍇.
𓆦 : ذأت الـ ٢٠ ؏ـام ◡‌ 🍇.
𓆦 : اعَرف اجرح بلكِلام بسہِ الرفقَ #بالحيوان واجَب  ◡‌ 🍇.``
— — — — — — — — —
`𓆦 : سَـجى  ◡‌ 🍇.
𓆦 : ذأت الـ ١٦ ؏ـام ◡‌ 🍇.
𓆦 : اگدر اهين #كرامتك بَس أني ماگدر اهين شي مموجود اصلاً  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : فَـرح  ◡‌ 🍇.
𓆦 : ذأت الـ ١٩ ؏ـام ◡‌ 🍇.
𓆦 : ذيل الجلب عمره مَ #ينـ؏ـدل  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : رؤأن  ◡‌ 🍇.
𓆦 : ذأت الـ ١٨ ؏ـام ◡‌ 🍇.
𓆦 : تُبچيني اغنية عن ايَ #قساوة تحچون؟  ◡‌ 🍇.`
— — — — — — — — —
`𓆦 : زۿـݛأء  ◡‌ 💞💌.
𓆦 : ذأت الـ ١٧ ؏ـام ◡‌ 💞💌.
𓆦 : وإنك كـل مَا أحب فِي هذه #الحياة ◡‌ 💞💌.`
— — — — — — — — —
`𓆦 : مَـ؏ـشۈقته ◡‌ 🦌💞.
𓆦 : ذآت ﺄلـ  ١٦ ؏َـام ◡‌ 🦌💞.
𓆦 : - أسافِر والأغانـي لـوجهَك #تردنـي ◡‌ 🦌💞.`

— — — — — — — — —
`𓆦 : بنَيتـۿ ◡‌ 🍋🌿.
𓆦 : ذآت ﺄلـ  ٢٠ ؏ـام ◡‌ 🍋🌿.
𓆦 : - إتباهـاا بيِّڪ هوايـَْه يَسمر #يحـلو ◡‌ 🍋🌿.`

— — — — — — — — —
`𓆦 : مݛيتـۿ ◡‌ 🤍💧.
𓆦 : ذآت ﺄلـ ١٨ ؏ـام ◡‌ 🤍💧.
𓆦 : - عينـاكَ بحر ومـا ڪان الغريـق الاَّ #أنـا ◡‌ 🤍💧.`

— — — — — — — — —
""")
@iqthon.on(admin_cmd(pattern="بايوهات2(?:\s|$)([\s\S]*)"))
async def permalink(mention):
    await edit_or_reply(mention, f"""
⠀⠀                
⠀ ⠀ ⠀⠀⠀`. ғʀᴏᴍ #𝙸𝚛𝚊𝚚 ↻.  
         𓆩 نحن ڪـ الفرص لا نأتي مرتين 𓆪
⠀ ⠀⠀ - ᴡᴇʟᴄᴏᴍᴇ ᴇᴠᴇʀʏᴏɴᴇ ❔ `

— — — — — — — — —⠀ ⠀
 ⠀⠀      ⠀⠀    ⠀ `- 𝟪.𝟣𝟨 𝑚𝑎𝑟𝑐ℎ 🕊: 
 ⠀⠀⠀⠀     - 𝑓𝑟𝑜𝑚 . . 𝐼𝑟𝑎𝑞 𝑏𝑎𝑔ℎ𝑑𝑎𝑑 📌.
       -رقيقـٰۿۃ‏ ڪہ ٱجنحۿۃ‏ ٱلفراشۿۃ‏🦋 `⠀⠀⠀⠀

— — — — — — — — —⠀⠀             ⠀⠀⠀ ⠀⠀⠀ 
⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀ ` ❲ 21 𝒚.𝒐 ❳
     ⠀⠀         ⠀⠀• َ𝒊𝒏 • 𝒃𝒂𝒈𝒉𝒅𝒂𝒅 ❄️  .
-ء ୪ أُعَوَّض ୪ ꪆ أُسَتبدَل ୪ ꪆ أُقارَن✋🏼. 📨!. `    
⠀⠀  ⠀⠀⠀   

— — — — — — — — —⠀⠀ ⠀ ⠀
 ⠀⠀        ⠀       `- :17y.o. 
                    - : 𝑖𝑛 iraq 🇮🇶. 
 ⠀⠀       كَـ حبة المَـطر، رقـيقة ☁️ . 
• 𝙻𝙸𝙺𝙴 𝙰 𝚁𝙰𝙸𝙽𝙳𝚁𝙾𝙿, 𝚃𝙷𝙸𝙽 . ❤️.`
  ⠀⠀         

— — — — — — — — —
 ⠀⠀ ⠀` - 𝒊𝒏 #Basra
 ⠀⠀     - ℒ𝒐𝒗𝒆 𝒎𝒚 𝒔𝒆𝒍𝒇
 ⠀⠀ ⠀ -  • أنيــــہ الإستثنائيـۃ  ، المختلفـۃ 🖤❕`

— — — — — — — — —⠀ ⠀ ⠀
 ⠀⠀      ⠀⠀    ⠀ `- 𝟒: 𝟏𝟏🏷: 
 ⠀⠀⠀⠀     -  𝐼𝑟𝑎𝑞: 𝐚𝐫𝐩𝐢𝐥🍂.
     - ﭑنـا بزوديَ ارتفع محد يعليني .` ⠀⠀⠀⠀

— — — — — — — — —⠀⠀             ⠀⠀⠀ ⠀⠀⠀ 
⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀ ` ❲ 01:23 ❳
     ⠀⠀         ⠀⠀- 𝐼𝑛 : 𝐷ℎ𝑖 𝑄𝑎𝑟 .
-يڪرهونَـيَ، وَيقلدون ﭑلمشـي الآمشيُـهہۛ 📨!. `    
⠀⠀  ⠀⠀⠀   

— — — — — — — — —
`‎  ‌‎  ‎  ‎  ‎  ‎  ‎  ‎  ‎  ‎  ‎ ‎ 𐄐 𝓑𝗮𝗴𝗵𝗱𝗮𝗱 🇮🇶 ⸃.
 ‎  .❕ ۿادئۃ مُتصالحۃة مع ڪل شيئَ : 
 ‎  ‎  ‎  ‌‎ ‎  ‎  ‎  ‎  ‎  ‎ ‎  ‎  ‎  𐄐 ‎ 𝟭𝟴  𝗬.𝗢 ⌝.`

— — — — — — — — —⠀ 
                ⠀⠀⠀⠀⠀    `˹ ↯  .
            ❥ ғʀᴏᴍ ɪʀᴀǫ 🇮🇶✿
    - هادئۿۃ‏، #قويۿۃ‏، جميلۿۃ‏، وحيدۿۃ‏🐆.`
          

— — — — — — — — —⠀⠀                
⠀ ⠀ ⠀⠀`⠀. ғʀᴏᴍ #𝙸𝚛𝚊𝚚 ↻.  
         𓆩 قـآتل مُـن ٱجل حلـمڪٰ دائما 𓆪
⠀ ⠀⠀ - ᴡᴇʟᴄᴏᴍᴇ ᴇᴠᴇʀʏᴏɴᴇ ❔`

— — — — — — — — —
⠀ ⠀ ⠀⠀`⠀. ғʀᴏᴍ #𝙸𝚛𝚊𝚚 ↻.  
         𓆩 نحن ڪـ الفرص لا نأتي مرتين 𓆪
⠀ ⠀⠀ - ᴡᴇʟᴄᴏᴍᴇ ᴇᴠᴇʀʏᴏɴᴇ ❔`
⠀

— — — — — — — — —

⠀` ‌⠀ ‌⠀ ‌ ⠀⠀ ⠀⠀ ‌   .𓆸 #𝘋𝘪𝘺𝘢𝘭𝘢 𑁍.
‌ ⠀ ‌ ⠀ ‌ ⠀ ‌ ⠀ - 𝘐 𝘯𝘦𝘦𝘥 𝘢 𝘯𝘦𝘷𝘦𝘳 𝘦𝘯𝘥𝘪𝘯𝘨 𝘩𝘶𝘨 .
‌ ⠀ ‌ ⠀ ‌ ⠀ ‌‌ ‌ ⠀ ⠀‌       .⧼ 𝟤𝟶𝟶𝟥 ☆. ⧽.`

— — — — — — — — —
""")

@iqthon.on(admin_cmd(pattern="بوسات", outgoing=True))
async def _(event):
		await event.edit("❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘❤😘")
		await asyncio.sleep(1)
		await event.edit("🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘🧡😘")
		await asyncio.sleep(1)
		await event.edit("💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘💛😘")
		await asyncio.sleep(1)
		await event.edit("💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘💚😘")
		await asyncio.sleep(1)
		await event.edit("💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘💙😘")
		await asyncio.sleep(1)
		await event.edit("💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘💜😘")
		await asyncio.sleep(1)
		await event.edit("🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘🤎😘")
		await asyncio.sleep(1)
		await event.edit("💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘💕😘")
		await asyncio.sleep(1)
		await event.edit("💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘💞😘")
		await asyncio.sleep(1)
		await event.edit("💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘💓😘")
		await asyncio.sleep(1)
		await event.edit("💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘💗😘")
		await asyncio.sleep(1)
		await event.edit("💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘💖😘")
		await asyncio.sleep(1)
		await event.edit("💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘💘😘")
		await asyncio.sleep(1)
		await event.edit("💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘💝😘")
		await asyncio.sleep(1)
		await event.edit("️♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘♥😘")
		    
FONT_FILE_TO_USE = "/usr/share/fonts/truetype/dejavu/DejaVuSans.ttf"

TELEGRAPH_MEDIA_LINKS = [
    "https://telegra.ph/file/e354ce72d5cc6a1d27c4d.jpg",
    "https://telegra.ph/file/8f9ff3d743e6707a61489.jpg",
    "https://telegra.ph/file/bfc97f4abc4bec6fe860d.jpg",
    "https://telegra.ph/file/5ef0f060023600ec08c19.jpg",
    "https://telegra.ph/file/a448465a3a8a251170f76.jpg",
    "https://telegra.ph/file/eb0ac1557668a98a38cb6.jpg",
    "https://telegra.ph/file/fdb3691a17a2c91fbe76c.jpg",
    "https://telegra.ph/file/ccdf69ebf6cb85c52a25b.jpg",
    "https://telegra.ph/file/2adffc55ac0c9733ecc7f.jpg",
    "https://telegra.ph/file/faca3b435da33f2f156f1.jpg",
    "https://telegra.ph/file/93d0a48c31e16f036f0e8.jpg",
    "https://telegra.ph/file/9ed89dc742b172a779312.jpg",
    "https://telegra.ph/file/0b4c19a19fb834d922d66.jpg",
    "https://telegra.ph/file/a95a0deb86f642129b067.jpg",
    "https://telegra.ph/file/c4c3d8b5cfc3cc5040833.jpg",
    "https://telegra.ph/file/1e1a1b52b9a313e066a04.jpg",
    "https://telegra.ph/file/a582950a8a259efdcbbc0.jpg",
    "https://telegra.ph/file/9c3a784d45790b193ca36.jpg",
    "https://telegra.ph/file/6aa74b17ae4e7dc46116f.jpg",
    "https://telegra.ph/file/e63cf624d1b68a5c819b6.jpg",
    "https://telegra.ph/file/7e420ad5995952ba1c262.jpg",
    "https://telegra.ph/file/c7a4dc3d2a9a422c19723.jpg",
    "https://telegra.ph/file/163c7eba56fd2e8c266e4.jpg",
    "https://telegra.ph/file/5c87b63ae326b5c3cd713.jpg",
    "https://telegra.ph/file/344ca22b35868c0a7661d.jpg",
    "https://telegra.ph/file/a0ef3e56f558f04a876aa.jpg",
    "https://telegra.ph/file/217b997ad9b5af8b269d0.jpg",
    "https://telegra.ph/file/b3595f99b221c56a5679b.jpg",
    "https://telegra.ph/file/aba7f4b4485c5aae53c52.jpg",
    "https://telegra.ph/file/209ca51dba6c0f1fba85f.jpg",
    "https://telegra.ph/file/2a0505ee2630bd6d7acca.jpg",
    "https://telegra.ph/file/d193d4191012f4aafd4d2.jpg",
    "https://telegra.ph/file/47e2d151984bd54a5d947.jpg",
    "https://telegra.ph/file/2a6c735b47db947b44599.jpg",
    "https://telegra.ph/file/7567774412fb76ceba95c.jpg",
    "https://telegra.ph/file/6dd8b0edec92b24985e13.jpg",
    "https://telegra.ph/file/dcf5e16cc344f1c030469.jpg",
    "https://telegra.ph/file/0718be0bd52a2eb7e36aa.jpg",
    "https://telegra.ph/file/0d7fcb82603b5db683890.jpg",
    "https://telegra.ph/file/44595caa95717f4db4788.jpg",
    "https://telegra.ph/file/f3a063d884d0dcde437e3.jpg",
    "https://telegra.ph/file/733425275da19cbed0822.jpg",
    "https://telegra.ph/file/aff5223e1aa29f212a46a.jpg",
    "https://telegra.ph/file/45ccfa3ef878bea9cfc02.jpg",
    "https://telegra.ph/file/a38aa50d009835177ac16.jpg",
    "https://telegra.ph/file/53e25b1b06f411ec051f0.jpg",
    "https://telegra.ph/file/96e801400487d0a120715.jpg",
    "https://telegra.ph/file/6ae8e799f2acc837e27eb.jpg",
    "https://telegra.ph/file/265ff1cebbb7042bfb5a7.jpg",
    "https://telegra.ph/file/4c8c9cd0751eab99600c9.jpg",
    "https://telegra.ph/file/1c6a5cd6d82f92c646c0f.jpg",
    "https://telegra.ph/file/2c1056c91c8f37fea838a.jpg",
    "https://telegra.ph/file/f140c121d03dfcaf4e951.jpg",
    "https://telegra.ph/file/39f7b5d1d7a3487f6ba69.jpg",
]


@iqthon.on(admin_cmd(pattern="انمي_تلقائي ?(.*)"))
async def autopic(event):
    while True:
        piclink = random.randint(0, len(TELEGRAPH_MEDIA_LINKS) - 1)
        AUTOPP = TELEGRAPH_MEDIA_LINKS[piclink]
        downloaded_file_name = "./DOWNLOADS/original_pic.png"
        downloader = SmartDL(AUTOPP, downloaded_file_name, progress_bar=True)
        downloader.start(blocking=False)
        photo = "photo_pfp.png"
        while not downloader.isFinished():
            pass

        shutil.copy(downloaded_file_name, photo)
        Image.open(photo)
        current_time = datetime.now().strftime(            "\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                                                   Time: %I:%M:%S \n                                                   Date: %d/%m/%y "        )
        img = Image.open(photo)
        drawn_text = ImageDraw.Draw(img)
        fnt = ImageFont.truetype(FONT_FILE_TO_USE, 30)
        drawn_text.text((300, 450), current_time, font=fnt, fill=(255, 255, 255))
        img.save(photo)
        file = await event.client.upload_file(photo)  
        try:
            await event.client(                functions.photos.UploadProfilePhotoRequest(file)  )
            os.remove(photo)

            await asyncio.sleep(60)
        except:
            return
